-- ============================================================================
-- ProjectZZZ: Добавление недостающих колонок
-- Дата генерации: 2026-03-24 02:28:18
-- ============================================================================


-- ============================================================================
-- ДОБАВЛЕНИЕ КОЛОНОК В SKUS
-- ============================================================================
ALTER TABLE skus ADD COLUMN IF NOT EXISTS article TEXT;


-- ============================================================================
-- ДОБАВЛЕНИЕ КОЛОНОК В PURCHASES
-- ============================================================================
ALTER TABLE purchases ADD COLUMN IF NOT EXISTS brand TEXT;
ALTER TABLE purchases ADD COLUMN IF NOT EXISTS product_group TEXT;
ALTER TABLE purchases ADD COLUMN IF NOT EXISTS marketing_group TEXT;

